server/src/tests/perfomanceTest/helpTest/artillery.config.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 20
      name: "Steady load"
    - duration: 30
      arrivalRate: 10
      name: "Ramp down"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

scenarios:
  - name: "Help Request API - Read Load"
    description: "Performance test for Help Request list endpoint with pagination"
    flow:
      - get:
          url: "/api/help/?page=1&limit=20"
          expect:
            - statusCode: 200
      
      - think: 1

      - get:
          url: "/api/help/?page=1&limit=50"
          expect:
            - statusCode: 200
      
      - think: 1

      - get:
          url: "/api/help/?page=2&limit=20"
          expect:
            - statusCode: 200